In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [18]:
#step 8
def get_top1000(group):
        return group.sort_values(by=['birth'], ascending=False)[:1000]
    
top1000 = names.groupby(['year', 'sex']).apply(get_top1000)
top1000.drop(columns=['year', 'sex'], inplace=True)
top1000.head()

                 name  birth      prop
year sex
1880 F   0       Mary   7065  0.077642
         1       Anna   2604  0.028617
         2       Emma   2003  0.022012
         3  Elizabeth   1939  0.021309
         4     Minnie   1746  0.019188